Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/atdf/PIC32MK0512GPE100.atdf
      <value-group caption="Turbo Master ADCx bits" name="ADCCON1__TRBMST">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="ADC5" name="" value="0x5" />
         <value caption="ADC4" name="" value="0x4" />
         <value caption="ADC3" name="" value="0x3" />
         <value caption="ADC2" name="" value="0x2" />
         <value caption="ADC1" name="" value="0x1" />
         <value caption="ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="Turbo Channel Error Status bit" name="ADCCON1__TRBERR">
         <value caption="An error occurred while setting the Turbo channel and Turbo channel function to be disabled regardless of the TRBEN bit being set to 1." name="" value="0x1" />
         <value caption="Turbo channel error did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Turbo Channel Enable bit" name="ADCCON1__TRBEN">
         <value caption="Enable the Turbo channel" name="" value="0x1" />
         <value caption="Disable the Turbo channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Clock Divider bits" name="ADCCON2__ADCDIV">
         <value caption="254 * Tq = Tad" name="" value="0x7f" />
         <value caption="6 * Tq = Tad" name="" value="0x3" />
         <value caption="4 * Tq = Tad" name="" value="0x2" />
         <value caption="2 * Tq = Tad" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Early Interrupt Select bits" name="ADCCON2__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Request Override bit" name="ADCCON2__ADCEIOVR">
         <value caption="Early interrupt generation is overridden and interrupt generation is controlled by the ADCGIRQEN1 and ADCGIRQEN2 registers" name="" value="0x1" />
         <value caption="Early interrupt generation is not overridden and interrupt generation is controlled by the ADCEIEN1 and ADCEIEN2 registers" name="" value="0x0" />
      </value-group>
      <value-group caption="End of Scan Interrupt Enable bit" name="ADCCON2__EOSIEN">
         <value caption="Interrupt will be generated when EOSRDY bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the EOSRDY bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/ Vref Voltage Fault Interrupt Enable bit" name="ADCCON2__REFFLTIEN">
         <value caption="Interrupt will be generated when the REFFLT bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the REFFLT bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/ Vref Voltage Ready Interrupt Enable bit" name="ADCCON2__BGVRIEN">
         <value caption="Interrupt will be generated when the BGVRDDY bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the BGVRRDY bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample Time for the Shared ADC (ADC7) bits" name="ADCCON2__SAMC">
         <value caption="1025 Tad" name="" value="0x3ff" />
         <value caption="3 Tad" name="" value="0x1" />
         <value caption="2 Tad" name="" value="0x0" />
      </value-group>
      <value-group caption="Capacitor Voltage Divider Setting bits" name="ADCCON2__CVDCPL">
         <value caption="7 * 2.5 pF = 17.5 pF" name="" value="0x7" />
         <value caption="6 * 2.5 pF = 15 pF" name="" value="0x6" />
         <value caption="5 * 2.5 pF = 12.5 pF" name="" value="0x5" />
         <value caption="4 * 2.5 pF = 10 pF" name="" value="0x4" />
         <value caption="3 * 2.5 pF = 7.5 pF" name="" value="0x3" />
         <value caption="2 * 2.5 pF = 5 pF" name="" value="0x2" />
         <value caption="1 * 2.5 pF = 2.5 pF" name="" value="0x1" />
         <value caption="0 * 2.5 pF = 0 pF" name="" value="0x0" />
      </value-group>
      <value-group caption="End of Scan Interrupt Status bit" name="ADCCON2__EOSRDY">
         <value caption="All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning" name="" value="0x1" />
         <value caption="Scanning has not completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/ Vref / AVdd BOR Fault Status bit" name="ADCCON2__REFFLT">
         <value caption="Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply." name="" value="0x1" />
         <value caption="Band gap and Vref voltage are working properly" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Voltage/ADC Reference Voltage Status bit" name="ADCCON2__BGVRRDY">
         <value caption="Both band gap voltage and ADC reference voltages (Vref) are ready" name="" value="0x1" />
         <value caption="Either or both band gap voltage and ADC reference voltages (Vref) are not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Input Select bits" name="ADCCON3__ADINSEL">
         <value caption="Reserved" name="" value="0x3f" />
         <value caption="Reserved" name="" value="0x36" />
         <value caption="CTMU Temperature Sensor (internal AN53)" name="" value="0x35" />
         <value caption="Vbat/2 (internal AN52)" name="" value="0x34" />
         <value caption="Reserved" name="" value="0x33" />
         <value caption="IVref 1.2V (internal AN50)" name="" value="0x32" />
         <value caption="AN49" name="" value="0x31" />
         <value caption="AN45" name="" value="0x2d" />
         <value caption="Reserved" name="" value="0x2c" />
         <value caption="Reserved" name="" value="0x2a" />
         <value caption="AN41" name="" value="0x29" />
         <value caption="AN33" name="" value="0x21" />
         <value caption="Reserved" name="" value="0x20" />
         <value caption="Reserved" name="" value="0x1c" />
         <value caption="AN27" name="" value="0x1b" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
