Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/atdf/PIC32MK0512GPE100.atdf
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN40">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN41">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN45">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN46">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN47">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN48">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN49">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN50">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN51">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN52">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN2__EIEN53">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY0">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS&lt;2:0&gt; bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY1">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS&lt;2:0&gt; bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY2">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS&lt;2:0&gt; bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY3">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS&lt;2:0&gt; bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
