Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/atdf/PIC32MK0512GPE100.atdf
         <register caption="CAN Filter Control Register 3" name="C2FLTCON3" offset="0x10f0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL12" values="C2FLTCON3__FSEL12" />
            <bitfield caption="Filter 12 Mask Select bits" mask="0x00000060" name="MSEL12" values="C2FLTCON3__MSEL12" />
            <bitfield caption="Filter 12 Enable bit" mask="0x00000080" name="FLTEN12" values="C2FLTCON3__FLTEN12" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL13" values="C2FLTCON3__FSEL13" />
            <bitfield caption="Filter 13 Mask Select bits" mask="0x00006000" name="MSEL13" values="C2FLTCON3__MSEL13" />
            <bitfield caption="Filter 13 Enable bit" mask="0x00008000" name="FLTEN13" values="C2FLTCON3__FLTEN13" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL14" values="C2FLTCON3__FSEL14" />
            <bitfield caption="Filter 14 Mask Select bits" mask="0x00600000" name="MSEL14" values="C2FLTCON3__MSEL14" />
            <bitfield caption="Filter 14 Enable bit" mask="0x00800000" name="FLTEN14" values="C2FLTCON3__FLTEN14" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL15" values="C2FLTCON3__FSEL15" />
            <bitfield caption="Filter 15 Mask Select bits" mask="0x60000000" name="MSEL15" values="C2FLTCON3__MSEL15" />
            <bitfield caption="Filter 15 Enable bit" mask="0x80000000" name="FLTEN15" values="C2FLTCON3__FLTEN15" />
         </register>
         <register caption="CAN Filter Control Register 3" name="C3FLTCON3" offset="0x40f0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL12" values="C3FLTCON3__FSEL12" />
            <bitfield caption="Filter 12 Mask Select bits" mask="0x00000060" name="MSEL12" values="C3FLTCON3__MSEL12" />
            <bitfield caption="Filter 12 Enable bit" mask="0x00000080" name="FLTEN12" values="C3FLTCON3__FLTEN12" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL13" values="C3FLTCON3__FSEL13" />
            <bitfield caption="Filter 13 Mask Select bits" mask="0x00006000" name="MSEL13" values="C3FLTCON3__MSEL13" />
            <bitfield caption="Filter 13 Enable bit" mask="0x00008000" name="FLTEN13" values="C3FLTCON3__FLTEN13" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL14" values="C3FLTCON3__FSEL14" />
            <bitfield caption="Filter 14 Mask Select bits" mask="0x00600000" name="MSEL14" values="C3FLTCON3__MSEL14" />
            <bitfield caption="Filter 14 Enable bit" mask="0x00800000" name="FLTEN14" values="C3FLTCON3__FLTEN14" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL15" values="C3FLTCON3__FSEL15" />
            <bitfield caption="Filter 15 Mask Select bits" mask="0x60000000" name="MSEL15" values="C3FLTCON3__MSEL15" />
            <bitfield caption="Filter 15 Enable bit" mask="0x80000000" name="FLTEN15" values="C3FLTCON3__FLTEN15" />
         </register>
         <register caption="CAN Filter Control Register 3" name="C4FLTCON3" offset="0x50f0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL12" values="C4FLTCON3__FSEL12" />
            <bitfield caption="Filter 12 Mask Select bits" mask="0x00000060" name="MSEL12" values="C4FLTCON3__MSEL12" />
            <bitfield caption="Filter 12 Enable bit" mask="0x00000080" name="FLTEN12" values="C4FLTCON3__FLTEN12" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL13" values="C4FLTCON3__FSEL13" />
            <bitfield caption="Filter 13 Mask Select bits" mask="0x00006000" name="MSEL13" values="C4FLTCON3__MSEL13" />
            <bitfield caption="Filter 13 Enable bit" mask="0x00008000" name="FLTEN13" values="C4FLTCON3__FLTEN13" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL14" values="C4FLTCON3__FSEL14" />
            <bitfield caption="Filter 14 Mask Select bits" mask="0x00600000" name="MSEL14" values="C4FLTCON3__MSEL14" />
            <bitfield caption="Filter 14 Enable bit" mask="0x00800000" name="FLTEN14" values="C4FLTCON3__FLTEN14" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL15" values="C4FLTCON3__FSEL15" />
            <bitfield caption="Filter 15 Mask Select bits" mask="0x60000000" name="MSEL15" values="C4FLTCON3__MSEL15" />
            <bitfield caption="Filter 15 Enable bit" mask="0x80000000" name="FLTEN15" values="C4FLTCON3__FLTEN15" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF0" offset="0x140" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF0__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF0__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF0__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF0" offset="0x1140" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF0__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF0__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF0__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C3RXF0" offset="0x4140" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C3RXF0__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C3RXF0__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C3RXF0__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C4RXF0" offset="0x5140" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXF0__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C4RXF0__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXF0__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF1" offset="0x150" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF1__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF1__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF1__SID" />
         </register>
