Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/atdf/PIC32MK0512GPE100.atdf
      <value-group caption="I/O Analog Charge Pump Enable bit" name="CFGCON__IOANCPEN">
         <value caption="Charge pump is enabled" name="" value="0x1" />
         <value caption="Charge pump is disabled (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Permission Group Lock bit" name="CFGCON__PGLOCK">
         <value caption="Permission Group registers are locked. Writes to PG registers are not allowed" name="" value="0x1" />
         <value caption="Permission Group registers are not locked. Writes to PG registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Module Disable bit" name="CFGCON__PMDLOCK">
         <value caption="Peripheral module is locked. Writes to PMD registers are not allowed" name="" value="0x1" />
         <value caption="Peripheral module is not locked. Writes to PMD registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Lock bit(" name="CFGCON__IOLOCK">
         <value caption="Peripheral Pin Select is locked. Writes to PPS registers are not allowed" name="" value="0x1" />
         <value caption="Peripheral Pin Select is not locked. Writes to PPS registers are allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Alternate Clock Selection bit" name="CFGCON__OCACLK">
         <value caption="Output Compare modules use an alternative Timer pair as their timebase clock" name="" value="0x1" />
         <value caption="All Output Compare modules use Timer2/3 as their timebase clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Alternate Clock Selection bit" name="CFGCON__ICACLK">
         <value caption="Input Capture modules use an alternative Timer pair as their timebase clock" name="" value="0x1" />
         <value caption="All Input Capture modules use Timer2/3 as their timebase clock" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Arbitration Priority to SRAM bit" name="CFGCON__ADCPRI">
         <value caption="ADC gets High Priority access to SRAM" name="" value="0x1" />
         <value caption="ADC uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Permission Group bits" name="CFGPG__CPUPG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Module Permission Group bits" name="CFGPG__DMAPG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="USB1 Module Permission Group bits" name="CFGPG__USB1PG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="USB2 Module Permission Group bits" name="CFGPG__USB2PG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN1 Module Permission Group bits" name="CFGPG__CAN1PG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN2 Module Permission Group bits" name="CFGPG__CAN2PG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN3 Module Permission Group bits" name="CFGPG__CAN3PG">
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;3&gt; = 1" name="" value="0x3" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;2&gt; = 1" name="" value="0x2" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;1&gt; = 1" name="" value="0x1" />
         <value caption="Read access if RDPER = 1; write access if WRPER&lt;0&gt; = 1" name="" value="0x0" />
      </value-group>
