Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/atdf/PIC32MK0512GPE100.atdf
         <register caption="" name="SBT1WR6" offset="0x8008" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR6__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR6__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR6__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR6__GROUP3" />
         </register>
         <register caption="" name="SBT1WR7" offset="0x8028" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR7__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR7__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR7__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR7__GROUP3" />
         </register>
         <register caption="" name="SBT1WR8" offset="0x8048" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR8__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR8__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR8__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR8__GROUP3" />
         </register>
         <register caption="" name="SBT2WR0" offset="0x8348" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2WR0__GROUP3" />
         </register>
         <register caption="" name="SBT2WR1" offset="0x8368" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2WR1__GROUP3" />
         </register>
         <register caption="" name="SBT2WR2" offset="0x8388" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2WR2__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2WR2__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2WR2__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2WR2__GROUP3" />
         </register>
         <register caption="" name="SBT3WR0" offset="0x8748" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3WR0__GROUP3" />
         </register>
         <register caption="" name="SBT3WR1" offset="0x8768" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3WR1__GROUP3" />
         </register>
         <register caption="" name="SBT3WR2" offset="0x8788" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3WR2__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3WR2__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3WR2__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3WR2__GROUP3" />
         </register>
      </register-group>
      <value-group caption="Target 0 Permission Group Violation Status bits" name="SBFLAG__T0PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 1Permission Group Violation Status bits" name="SBFLAG__T1PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 2 Permission Group Violation Status bits" name="SBFLAG__T2PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
      <value-group caption="Target 3 Permission Group Violation Status bits" name="SBFLAG__T3PGV">
         <value caption="Target is reporting a Permission Group (PG) violation" name="" value="0x1" />
         <value caption="Target is not reporting a PG violation" name="" value="0x0" />
      </value-group>
