Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/atdf/PIC32MK0512GPE100.atdf
         <register caption="USB OTG Status Register (x = 1 and 2)" name="U2OTGSTAT" offset="0x1020" rw="RW" size="4">
            <bitfield caption="A-Device Vbus Valid Indicator bit" mask="0x00000001" name="VBUSVD" values="U2OTGSTAT__VBUSVD" />
            <bitfield caption="B-Device Session End Indicator bit" mask="0x00000004" name="SESEND" values="U2OTGSTAT__SESEND" />
            <bitfield caption="Session Valid Indicator bit" mask="0x00000008" name="SESVD" values="U2OTGSTAT__SESVD" />
            <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATE" values="U2OTGSTAT__LSTATE" />
            <bitfield caption="ID Pin State Indicator bit" mask="0x00000080" name="ID" values="U2OTGSTAT__ID" />
         </register>
         <register caption="USB OTG Control Register (x = 1 and 2)" name="U1OTGCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="Vbus Discharge Enable bit" mask="0x00000001" name="VBUSDIS" values="U1OTGCON__VBUSDIS" />
            <bitfield caption="Vbus Charge Enable bit" mask="0x00000002" name="VBUSCHG" values="U1OTGCON__VBUSCHG" />
            <bitfield caption="OTG Functionality Enable bit" mask="0x00000004" name="OTGEN" values="U1OTGCON__OTGEN" />
            <bitfield caption="Vbus Power-on bit" mask="0x00000008" name="VBUSON" values="U1OTGCON__VBUSON" />
            <bitfield caption="D- Pull-Down Enable bit" mask="0x00000010" name="DMPULDWN" values="U1OTGCON__DMPULDWN" />
            <bitfield caption="D+ Pull-Down Enable bit" mask="0x00000020" name="DPPULDWN" values="U1OTGCON__DPPULDWN" />
            <bitfield caption="D- Pull-Up Enable bit" mask="0x00000040" name="DMPULUP" values="U1OTGCON__DMPULUP" />
            <bitfield caption="D+ Pull-Up Enable bit" mask="0x00000080" name="DPPULUP" values="U1OTGCON__DPPULUP" />
         </register>
         <register caption="USB OTG Control Register (x = 1 and 2)" name="U2OTGCON" offset="0x1030" rw="RW" size="4">
            <bitfield caption="Vbus Discharge Enable bit" mask="0x00000001" name="VBUSDIS" values="U2OTGCON__VBUSDIS" />
            <bitfield caption="Vbus Charge Enable bit" mask="0x00000002" name="VBUSCHG" values="U2OTGCON__VBUSCHG" />
            <bitfield caption="OTG Functionality Enable bit" mask="0x00000004" name="OTGEN" values="U2OTGCON__OTGEN" />
            <bitfield caption="Vbus Power-on bit" mask="0x00000008" name="VBUSON" values="U2OTGCON__VBUSON" />
            <bitfield caption="D- Pull-Down Enable bit" mask="0x00000010" name="DMPULDWN" values="U2OTGCON__DMPULDWN" />
            <bitfield caption="D+ Pull-Down Enable bit" mask="0x00000020" name="DPPULDWN" values="U2OTGCON__DPPULDWN" />
            <bitfield caption="D- Pull-Up Enable bit" mask="0x00000040" name="DMPULUP" values="U2OTGCON__DMPULUP" />
            <bitfield caption="D+ Pull-Up Enable bit" mask="0x00000080" name="DPPULUP" values="U2OTGCON__DPPULUP" />
         </register>
         <register caption="USB Power Control Register (x = 1 and 2)" name="U1PWRC" offset="0x40" rw="RW" size="4">
            <bitfield caption="USB Operation Enable bit" mask="0x00000001" name="USBPWR" values="U1PWRC__USBPWR" />
            <bitfield caption="USB Suspend Mode bit" mask="0x00000002" name="USUSPEND" values="U1PWRC__USUSPEND" />
            <bitfield caption="USB Module Busy bit" mask="0x00000008" name="USBBUSY" values="U1PWRC__USBBUSY" />
            <bitfield caption="USB Sleep Entry Guard bit" mask="0x00000010" name="USLPGRD" values="U1PWRC__USLPGRD" />
            <bitfield caption="USB Activity Pending bit" mask="0x00000080" name="UACTPND" values="U1PWRC__UACTPND" />
         </register>
         <register caption="USB Power Control Register (x = 1 and 2)" name="U2PWRC" offset="0x1040" rw="RW" size="4">
            <bitfield caption="USB Operation Enable bit" mask="0x00000001" name="USBPWR" values="U2PWRC__USBPWR" />
            <bitfield caption="USB Suspend Mode bit" mask="0x00000002" name="USUSPEND" values="U2PWRC__USUSPEND" />
            <bitfield caption="USB Module Busy bit" mask="0x00000008" name="USBBUSY" values="U2PWRC__USBBUSY" />
            <bitfield caption="USB Sleep Entry Guard bit" mask="0x00000010" name="USLPGRD" values="U2PWRC__USLPGRD" />
            <bitfield caption="USB Activity Pending bit" mask="0x00000080" name="UACTPND" values="U2PWRC__UACTPND" />
         </register>
         <register caption="USB Interrupt Register (x = 1 and 2)" name="U1IR" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="(Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode" mask="0x00000001" name="URSTIF_DETACHIF" values="U1IR__URSTIF_DETACHIF" />
            <bitfield caption="USB Error Condition Interrupt bit" mask="0x00000002" name="UERRIF" values="U1IR__UERRIF" />
            <bitfield caption="SOF Token Interrupt bit" mask="0x00000004" name="SOFIF" values="U1IR__SOFIF" />
            <bitfield caption="Token Processing Complete Interrupt bit" mask="0x00000008" name="TRNIF" values="U1IR__TRNIF" />
            <bitfield caption="Idle Detect Interrupt bit" mask="0x00000010" name="IDLEIF" values="U1IR__IDLEIF" />
            <bitfield caption="Resume Interrupt bit" mask="0x00000020" name="RESUMEIF" values="U1IR__RESUMEIF" />
            <bitfield caption="Peripheral Attach Interrupt bit" mask="0x00000040" name="ATTACHIF" values="U1IR__ATTACHIF" />
            <bitfield caption="STALL Handshake Interrupt bit" mask="0x00000080" name="STALLIF" values="U1IR__STALLIF" />
         </register>
         <register caption="USB Interrupt Register (x = 1 and 2)" name="U2IR" offset="0x11c0" rw="RW" size="4">
            <bitfield caption="(Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode" mask="0x00000001" name="URSTIF_DETACHIF" values="U2IR__URSTIF_DETACHIF" />
            <bitfield caption="USB Error Condition Interrupt bit" mask="0x00000002" name="UERRIF" values="U2IR__UERRIF" />
            <bitfield caption="SOF Token Interrupt bit" mask="0x00000004" name="SOFIF" values="U2IR__SOFIF" />
            <bitfield caption="Token Processing Complete Interrupt bit" mask="0x00000008" name="TRNIF" values="U2IR__TRNIF" />
            <bitfield caption="Idle Detect Interrupt bit" mask="0x00000010" name="IDLEIF" values="U2IR__IDLEIF" />
            <bitfield caption="Resume Interrupt bit" mask="0x00000020" name="RESUMEIF" values="U2IR__RESUMEIF" />
            <bitfield caption="Peripheral Attach Interrupt bit" mask="0x00000040" name="ATTACHIF" values="U2IR__ATTACHIF" />
            <bitfield caption="STALL Handshake Interrupt bit" mask="0x00000080" name="STALLIF" values="U2IR__STALLIF" />
         </register>
