Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/atdf/PIC32MK0512GPE100.atdf
      <value-group caption="(Device mode) USB Reset Interrupt Enable bit Device mode / (Host mode)USB Detach Interrupt Enable bit Host Mode" name="U2IE__URSTIE_DETACHIE">
         <value caption="(Device mode) URSTIF interrupt is enabled / (Host mode) DATTCHIF interrupt is enabled" name="" value="0x1" />
         <value caption="(Device mode) URSTIF interrupt is disabled / (Host mode) DATTCHIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Error Interrupt Enable bit" name="U2IE__UERRIE">
         <value caption="USB Error interrupt is enabled" name="" value="0x1" />
         <value caption="USB Error interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SOF Token Interrupt Enable bit" name="U2IE__SOFIE">
         <value caption="SOFIF interrupt is enabled" name="" value="0x1" />
         <value caption="SOFIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Token Processing Complete Interrupt Enable bit" name="U2IE__TRNIE">
         <value caption="TRNIF interrupt is enabled" name="" value="0x1" />
         <value caption="TRNIF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Idle Detect Interrupt Enable bit" name="U2IE__IDLEIE">
         <value caption="Idle interrupt is enabled" name="" value="0x1" />
         <value caption="Idle interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RESUME Interrupt Enable bit" name="U2IE__RESUMEIE">
         <value caption="RESUME interrupt is enabled" name="" value="0x1" />
         <value caption="RESUME interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ATTACH Interrupt Enable bit" name="U2IE__ATTACHIE">
         <value caption="ATTACH interrupt is enabled" name="" value="0x1" />
         <value caption="ATTACH interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL Handshake Interrupt Enable bit" name="U2IE__STALLIE">
         <value caption="STALL interrupt is enabled" name="" value="0x1" />
         <value caption="STALL interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PID Check Failure Flag bit" name="U1EIR__PIDEF">
         <value caption="PID check failed" name="" value="0x1" />
         <value caption="PID check passed" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit" name="U1EIR__CRC5EF_EOFEF">
         <value caption="(Device mode)Token packet rejected due to CRC5 error / (Host mode)EOF error condition detected" name="" value="0x1" />
         <value caption="(Device mode)Token packet accepted / (Host mode)No EOF error condition" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC16 Failure Flag bit" name="U1EIR__CRC16EF">
         <value caption="Data packet rejected due to CRC16 error" name="" value="0x1" />
         <value caption="Data packet accepted" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Field Size Error Flag bit" name="U1EIR__DFN8EF">
         <value caption="Data field received is not an integral number of bytes" name="" value="0x1" />
         <value caption="Data field received is an integral number of bytes" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Turnaround Time-Out Error Flag bit" name="U1EIR__BTOEF">
         <value caption="Bus turnaround time-out has occurred" name="" value="0x1" />
         <value caption="No bus turnaround time-out" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Error Flag bit" name="U1EIR__DMAEF">
         <value caption="USB DMA error condition detected" name="" value="0x1" />
         <value caption="No DMA error" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Matrix Error Flag bit" name="U1EIR__BMXEF">
         <value caption="The base address" name="" value="0x1" />
         <value caption="No address error" name="" value="0x0" />
      </value-group>
      <value-group caption="Bit Stuff Error Flag bit" name="U1EIR__BTSEF">
         <value caption="Packet rejected due to bit stuff error" name="" value="0x1" />
         <value caption="Packet accepted" name="" value="0x0" />
      </value-group>
      <value-group caption="PID Check Failure Flag bit" name="U2EIR__PIDEF">
         <value caption="PID check failed" name="" value="0x1" />
         <value caption="PID check passed" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit" name="U2EIR__CRC5EF_EOFEF">
         <value caption="(Device mode)Token packet rejected due to CRC5 error / (Host mode)EOF error condition detected" name="" value="0x1" />
         <value caption="(Device mode)Token packet accepted / (Host mode)No EOF error condition" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC16 Failure Flag bit" name="U2EIR__CRC16EF">
         <value caption="Data packet rejected due to CRC16 error" name="" value="0x1" />
         <value caption="Data packet accepted" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Field Size Error Flag bit" name="U2EIR__DFN8EF">
         <value caption="Data field received is not an integral number of bytes" name="" value="0x1" />
         <value caption="Data field received is an integral number of bytes" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Turnaround Time-Out Error Flag bit" name="U2EIR__BTOEF">
         <value caption="Bus turnaround time-out has occurred" name="" value="0x1" />
         <value caption="No bus turnaround time-out" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Error Flag bit" name="U2EIR__DMAEF">
         <value caption="USB DMA error condition detected" name="" value="0x1" />
         <value caption="No DMA error" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Matrix Error Flag bit" name="U2EIR__BMXEF">
         <value caption="The base address" name="" value="0x1" />
         <value caption="No address error" name="" value="0x0" />
      </value-group>
      <value-group caption="Bit Stuff Error Flag bit" name="U2EIR__BTSEF">
         <value caption="Packet rejected due to bit stuff error" name="" value="0x1" />
         <value caption="Packet accepted" name="" value="0x0" />
      </value-group>
      <value-group caption="PID Check Failure Interrupt Enable bit" name="U1EIE__PIDEE">
         <value caption="PIDEF interrupt is enabled" name="" value="0x1" />
         <value caption="PIDEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode) CRC5 Host Error Interrupt Enable bit / (Host mode) EOF Error Interrupt Enable bit" name="U1EIE__CRC5EE_EOFEE">
         <value caption="(Device mode)CRC5EF interrupt is enabled / (Host mode)EOF interrupt is enabled" name="" value="0x1" />
         <value caption="(Device mode)CRC5EF interrupt is disabled / (Host mode)EOF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC16 Failure Interrupt Enable bit" name="U1EIE__CRC16EE">
         <value caption="CRC16EF interrupt is enabled" name="" value="0x1" />
         <value caption="CRC16EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Field Size Error Interrupt Enable bit" name="U1EIE__DFN8EE">
         <value caption="DFN8EF interrupt is enabled" name="" value="0x1" />
         <value caption="DFN8EF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Turnaround Time-out Error Interrupt Enable bit" name="U1EIE__BTOEE">
         <value caption="BTOEF interrupt is enabled" name="" value="0x1" />
         <value caption="BTOEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Error Interrupt Enable bit" name="U1EIE__DMAEE">
         <value caption="DMAEF interrupt is enabled" name="" value="0x1" />
         <value caption="DMAEF interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Matrix Error Interrupt Enable bit" name="U1EIE__BMXEE">
         <value caption="BMXEF interrupt is enabled" name="" value="0x1" />
         <value caption="BMXEF interrupt is disabled" name="" value="0x0" />
      </value-group>
