Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/atdf/PIC32MK0512GPE100.atdf
      <value-group caption="USB" name="U1CNFG1__UOEMON">
         <value caption="OE signal is active; it indicates intervals during which the D+/D- lines are driving" name="" value="0x1" />
         <value caption="OE signal is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Eye-Pattern Test Enable bit" name="U1CNFG1__UTEYE">
         <value caption="Eye-Pattern Test is enabled" name="" value="0x1" />
         <value caption="Eye-Pattern Test is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Suspend Enable bit" name="U2CNFG1__UASUSPND">
         <value caption="USB module automatically suspends upon entry to Sleep mode. See the USUSPEND bit (UxPWRC) in" name="" value="0x1" />
         <value caption="USB module does not automatically suspend upon entry to Sleep mode. Software must use the USUSPEND bit (UxPWRC) to suspend the module" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Speed Device Enable bit" name="U2CNFG1__LSDEV">
         <value caption="USB module to operate in Low-Speed Device mode" name="" value="0x1" />
         <value caption="USB module to operate in OTG" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U2CNFG1__USBSIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="USB" name="U2CNFG1__UOEMON">
         <value caption="OE signal is active; it indicates intervals during which the D+/D- lines are driving" name="" value="0x1" />
         <value caption="OE signal is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Eye-Pattern Test Enable bit" name="U2CNFG1__UTEYE">
         <value caption="Eye-Pattern Test is enabled" name="" value="0x1" />
         <value caption="Eye-Pattern Test is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP0__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP0__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP0__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP0__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP0__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Retry Disable bit" name="U1EP0__RETRYDIS">
         <value caption="Retry NAKed transactions is disabled" name="" value="0x1" />
         <value caption="Retry NAKed transactions is enabled; retry done in hardware" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Speed Direct Connection Enable bit" name="U1EP0__LSPD">
         <value caption="Direct connection to a low-speed device is enabled" name="" value="0x1" />
         <value caption="Direct connection to a low-speed device is disabled; hub required with PRE_PID" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U2EP0__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U2EP0__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U2EP0__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U2EP0__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U2EP0__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Retry Disable bit" name="U2EP0__RETRYDIS">
         <value caption="Retry NAKed transactions is disabled" name="" value="0x1" />
         <value caption="Retry NAKed transactions is enabled; retry done in hardware" name="" value="0x0" />
      </value-group>
